In [ ]:
import pandas as p
import seaborn as sns
p.__version__  #cell의 마지막 줄은 항상 출력

'1.1.5'

#시리즈와 데이터프레임

##시리즈(Series)

In [ ]:
['Dog','Cat','Tiger','Lion','Monkey']

['Dog', 'Cat', 'Tiger', 'Lion', 'Monkey']

In [ ]:
{'0':'Dog','1':'Cat','2':'Tiger','3':'Lion','4':'Monkey'}

{'0': 'Dog', '1': 'Cat', '2': 'Tiger', '3': 'Lion', '4': 'Monkey'}

In [ ]:
#리스트를 통한 판다스 시리즈 생성
p.Series(['Dog','Cat','Tiger','Lion','Monkey'],index=[11,12,13,14,15])

11       Dog
12       Cat
13     Tiger
14      Lion
15    Monkey
dtype: object

In [ ]:
#딕셔너리를 통한 판다스 시리즈 생성
p.Series({'00':'Dog','01':'Cat','02':'Tiger','03':'Lion','04':'Monkey'})

00       Dog
01       Cat
02     Tiger
03      Lion
04    Monkey
dtype: object

In [ ]:
#튜플을 통한 판다스 시리즈 생성
p.Series(("페이커","남자","대한민국"),["이름","성별","국가"])

이름     페이커
성별      남자
국가    대한민국
dtype: object

##데이터프레임

In [ ]:
dict_data={"동물":['Dog','Cat','Tiger','Lion','Monkey'],"나이":[1,2,3,4,5]}
dict_data

{'나이': [1, 2, 3, 4, 5], '동물': ['Dog', 'Cat', 'Tiger', 'Lion', 'Monkey']}

In [ ]:
p.DataFrame(dict_data)

       동물  나이
0     Dog   1
1     Cat   2
2   Tiger   3
3    Lion   4
4  Monkey   5

In [ ]:
doublelist_data=[['Dog',1],['Cat',2],['Tiger',3],['Lion',4],['Monkey',5]]
p.DataFrame(doublelist_data,columns=["동물","나이"])

       동물  나이
0     Dog   1
1     Cat   2
2   Tiger   3
3    Lion   4
4  Monkey   5

In [ ]:
#0628 직접해보기(더블리스트)
assinment0628=[["Jones LLC",150,200,140],["Alpha Co",200,210,215],["Blue Inc",50, 90, 95]]
p.DataFrame(assinment0628,columns=["account","Jan","Feb","Mar"])

     account  Jan  Feb  Mar
0  Jones LLC  150  200  140
1   Alpha Co  200  210  215
2   Blue Inc   50   90   95

In [ ]:
#0628 직접해보기(딕셔너리)
assinment0628dict={"account":["Jones LLC","Alpha Co","Blue Inc"],"Jan":[150,200,50],"Feb":[200,210,90],"Mar":[140,215,95]}
p.DataFrame(assinment0628dict)

     account  Jan  Feb  Mar
0  Jones LLC  150  200  140
1   Alpha Co  200  210  215
2   Blue Inc   50   90   95

#데이터프레임 조작

##데이터요약

In [ ]:
tips=sns.load_dataset("tips")
tips

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [ ]:
#자료의 구조 확인
tips.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  244 non-null    float64
 1   tip         244 non-null    float64
 2   sex         244 non-null    category
 3   smoker      244 non-null    category
 4   day         244 non-null    category
 5   time        244 non-null    category
 6   size        244 non-null    int64
dtypes: category(4), float64(2), int64(1)
memory usage: 7.3 KB

In [ ]:
tips.head() #자료 중 앞 5개만 출력

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [ ]:
tips.tail() #자료 중 뒤 5개만 출력

     total_bill   tip     sex smoker   day    time  size
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

In [ ]:
#변수(열,컬럼,특징,피처)
#변수값 = 컬럼 하나의 모든 값
#관측치 = 인덱스포함 행의 모든 값
#행,로우 데이터양 = 인덱스 제외 행의 모든 값
#관측값

#행이 많다 -> 데이터가 많다
#열이 많다 -> 데이터의 특징이 많다. 분석시 다양한 조합이 가능

#깔끔한 데이터: 조작, 모형화, 시각화가 용이하게

##행과 열

###행

In [ ]:
tips1=tips.drop(1)
tips1.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4
5       25.29  4.71    Male     No  Sun  Dinner     4

In [ ]:
#index 2의 값만 가져오고 싶을때(index에 해당 값이 없을 경우 에러)
tips1.loc[2]

total_bill     21.01
tip              3.5
sex             Male
smoker            No
day              Sun
time          Dinner
size               3
Name: 2, dtype: object

In [ ]:
#index의 2번째 값을 가져옴(0번째 부터 시작)
tips1.iloc[2]

total_bill     23.68
tip             3.31
sex             Male
smoker            No
day              Sun
time          Dinner
size               2
Name: 3, dtype: object

In [ ]:
#특정범위 슬라이싱
tips.loc[0:3]

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2

In [ ]:
tips.iloc[0:3]

   total_bill   tip     sex smoker  day    time  size  total smoker_str
0       16.99  1.01  Female     No  Sun  Dinner     2  18.00         No
1       10.34  1.66    Male     No  Sun  Dinner     3  12.00         No
2       21.01  3.50    Male     No  Sun  Dinner     3  24.51         No

In [ ]:
#0, 140, 240번 인덱스를 확인하려고 할때
tips1.loc[[0,140,240]]

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
140       17.47  3.50  Female     No  Thur   Lunch     2
240       27.18  2.00  Female    Yes   Sat  Dinner     2

In [ ]:
#total_bill과 day culumn만 0:3번까지 확인하고 싶을 때
tips1.loc[0:3,['total_bill','day']]

   total_bill  day
0       16.99  Sun
2       21.01  Sun
3       23.68  Sun

In [ ]:
tips1.iloc[0:3,[0,4]] #순서로 접근할 땐 무조건 iloc

   total_bill  day
0       16.99  Sun
2       21.01  Sun
3       23.68  Sun

In [ ]:
#행 x, 열 y의 값을 가져오고 싶을때 iat[x,y]
tips1.iat[1,1]

3.5

In [ ]:
#tip이 7달러 이상인 데이터 추출
for i in tips:
  if i=='tip':
    for j in tips[i]:
      if j>7:
        print(j)
print("-------------------------------------")
#tip은 딕셔너리 형태임을 이용(행 기반)
tips[tips['tip']>7]

7.58
10.0
9.0
-------------------------------------

     total_bill    tip   sex smoker  day    time  size  total smoker_str
23        39.42   7.58  Male     No  Sat  Dinner     4  47.00         No
170       50.81  10.00  Male    Yes  Sat  Dinner     3  60.81        Yes
212       48.33   9.00  Male     No  Sat  Dinner     4  57.33         No

In [ ]:
#tip이 7이상이고 size가 4인 값 추출
tips[(tips['tip']>7)&(tips['size']==4)]

     total_bill   tip   sex smoker  day    time  size
23        39.42  7.58  Male     No  Sat  Dinner     4
212       48.33  9.00  Male     No  Sat  Dinner     4

###열

In [ ]:
tips['tip']

0      1.01
1      1.66
2      3.50
3      3.31
4      3.61
       ...
239    5.92
240    2.00
241    2.00
242    1.75
243    3.00
Name: tip, Length: 244, dtype: float64

In [ ]:
tips.tip #위랑 같음

0      1.01
1      1.66
2      3.50
3      3.31
4      3.61
       ...
239    5.92
240    2.00
241    2.00
242    1.75
243    3.00
Name: tip, Length: 244, dtype: float64

In [ ]:
tips[['tip','day']]

      tip   day
0    1.01   Sun
1    1.66   Sun
2    3.50   Sun
3    3.31   Sun
4    3.61   Sun
..    ...   ...
239  5.92   Sat
240  2.00   Sat
241  2.00   Sat
242  1.75   Sat
243  3.00  Thur

[244 rows x 2 columns]

In [ ]:
#total이란 새로운 변수 생성->파생변수
#파생변수는 기존 데이터에서 새로운 데이터 획득을 위해
#그리고 원본(law)데이터를 보존하기 위해 사용 : 다른 분석에 영향을 줄 가능성 배제
tips['total']=tips['total_bill']+tips['tip']
tips[0:3]

   total_bill   tip     sex smoker  day    time  size  total
0       16.99  1.01  Female     No  Sun  Dinner     2  18.00
1       10.34  1.66    Male     No  Sun  Dinner     3  12.00
2       21.01  3.50    Male     No  Sun  Dinner     3  24.51

In [ ]:
tips.dtypes

total_bill     float64
tip            float64
sex           category
smoker        category
day           category
time          category
size             int64
total          float64
dtype: object

In [ ]:
tips.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  244 non-null    float64
 1   tip         244 non-null    float64
 2   sex         244 non-null    category
 3   smoker      244 non-null    category
 4   day         244 non-null    category
 5   time        244 non-null    category
 6   size        244 non-null    int64
 7   total       244 non-null    float64
dtypes: category(4), float64(3), int64(1)
memory usage: 9.2 KB

In [ ]:
#데이터테이블의 데이터타입 변환
# 1. 파생변수 설정
# 2. 데이터타입 변경
tips["smoker_str"]=tips["smoker"].astype(str)
tips.dtypes

total_bill     float64
tip            float64
sex           category
smoker        category
day           category
time          category
size             int64
total          float64
smoker_str      object
dtype: object

In [ ]:
tips.values

array([[16.99, 1.01, 'Female', ..., 2, 18, 'No'],
       [10.34, 1.66, 'Male', ..., 3, 12, 'No'],
       [21.01, 3.5, 'Male', ..., 3, 24, 'No'],
       ...,
       [22.67, 2.0, 'Male', ..., 2, 24, 'Yes'],
       [17.82, 1.75, 'Male', ..., 2, 19, 'No'],
       [18.78, 3.0, 'Female', ..., 2, 21, 'No']], dtype=object)